import java.util.ArrayList;
import java.util.Scanner;

public class Demo
{
    public static void main(String[] args) {
        Server server=new Server();
        /*
        если используем один сканер на весь проект то он должен работать с одним типом данных
        програма падает если при логине я ввел несуществующий логин
        когда я зарегистрировал первого пользователя и указал что я админ
        мне не дало посмотреть список в режиме админа программа сказала что я не админ

         */
    }
}
